<?php
///////////////////////////////////////////////////////////////////////
/// LITTLE-NET WEB TOOL : BasicAuth 1.7
/// http://l-tool.net/
/// http://little-net.jp/
/// Copyright (C) Akira Mori. All rights reserved.
/// 2008-03-15 : created
/// 2013-09-09 : modified
/// [UTF-8]
///////////////////////////////////////////////////////////////////////
$LLMSG_MYSTR = array('basicauth01'		=> 'ＰＨＰの実行ユーザーＩＤと各種ファイルの所有者ＩＤが違うサーバーの為、このスクリプトは使用できません。','sinfoinsinchk01'	=> '最初のユーザーは管理者で登録して下さい。','sinfoinsinchk02'	=> 'このユーザー名は既に登録されています。','sinfoins01'	=>	'情報を登録しました。','sinfoins02'	=>	'情報を登録できませんでした。','sinfoupd01'	=>	'情報を更新しました。','sinfoupd02'	=>	'情報を更新できませんでした。','sinfodel01'	=>	'情報を削除しました。','sinfodel02'	=>	'情報を削除できませんでした。','sinfoclear01'	=>	'登録されていた全てのユーザー情報を削除し、BASIC認証を解除しました。<br />'.
'この管理機能を使用しない場合は管理機能をサーバーから削除して下さい。','sinfologdel01'	=>	'このユーザーのアクセス記録を消去しました。','sinfologclear01'=>	'全ユーザーのアクセス記録を消去しました。','basicfile01'	=> '$p1 ファイルが見つかりません。説明書に従ってアップロードして下さい。','basicfile02'	=> '$p1 ファイルを更新できません。ファイル属性（パーミッション）を説明書に従って変更して下さい。',);
?>